### Merge Dataframe

###

- Used to merge 2 different dataframes

Syntax:

        pd.merge(data_frame_1, data_frame_2, on = "column on which i want to perform this operation")

- Only common elements in both the dataframes gets merged i.e. INTERSECTION / INNER JOIN

- In order to get all the elements from both the data frames, we'll use how = "outer" which will act as UNION

- By default how is inner

In [11]:
import pandas as pd

df = pd.DataFrame({
    "city" : ["new york", "chicago", "orlando", "baltimore"],
    "temperature" : [21, 14, 35, 32]
})

df

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [14]:
df2 = pd.DataFrame({
    'city' : ["chicago", "new york", "san francisco"],
    'humidity' : [65, 68, 71]
})

df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [15]:
df3 = pd.merge(df, df2, on = "city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [16]:
df3 = pd.merge(df, df2, how='outer')
df3

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      71.0

In [17]:
df3 = pd.merge(df, df2, how='inner')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [18]:
df3 = pd.merge(df, df2, how='left')
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           32       NaN

<img src = "Left_join.png" height = 300px>

In [19]:
df3 = pd.merge(df, df2, how='right')
df3

            city  temperature  humidity
0        chicago         14.0        65
1       new york         21.0        68
2  san francisco          NaN        71

###

- indicator flag tells us where the data came from

In [20]:
df3 = pd.merge(df, df2, how='outer', indicator=True)
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

In [22]:
df = pd.DataFrame({
    "city" : ["new york", "chicago", "orlando", "baltimore"],
    "temperature" : [21, 14, 35, 32],
    'humidity' : [65, 68, 71, 75]
})

df

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           32        75

In [24]:
df2 = pd.DataFrame({
    'city' : ["chicago", "new york", "san francisco"],
    "temperature" : [21, 14, 35],
    'humidity' : [65, 68, 71]
})
df2

            city  temperature  humidity
0        chicago           21        65
1       new york           14        68
2  san francisco           35        71

In [26]:
df3 = pd.merge(df, df2, on='city')
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             14          68
1   chicago             14          68             21          65

- The above dataframe merges both dataframes with same column name(let's say temperature) as temperature_x and temperature_y, in order to change that, we can use suffixes arguement to change x and y

In [27]:
df3 = pd.merge(df, df2, on='city', suffixes=('_left', '_right'))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65